### Connect to SQL Magic

In [2]:
%load_ext sql

In [3]:
%sql sqlite://

'Connected: @None'

### Import data with Pandas

In [4]:
import pandas
exam_results = pandas.read_csv(r"C:\Users\anafi\Documents\Personal\Applications\2020\Roche\Tasks\Task3\exam_results.csv")
%sql PERSIST exam_results

import pandas
students = pandas.read_csv(r"C:\Users\anafi\Documents\Personal\Applications\2020\Roche\Tasks\Task3\students.csv")
%sql PERSIST students

import pandas
class_catalogue = pandas.read_csv(r"C:\Users\anafi\Documents\Personal\Applications\2020\Roche\Tasks\Task3\class_catalogue.csv")
%sql PERSIST class_catalogue

 * sqlite://
 * sqlite://
 * sqlite://

'Persisted class_catalogue'

### View tables

In [5]:
%sql select * from students

 * sqlite://
Done.

[(0, 34577, 'John', 'Peters', '02/15/93', 'Mathematics'),
 (1, 34578, 'Kate', 'Smith', '10/29/92', 'Economy')]

In [6]:
%sql select * from class_catalogue

 * sqlite://
Done.

[(0, 6743, 'algebra', 4352, '2019_summer'),
 (1, 2876, 'calculus', 5325, '2019_summer'),
 (2, 3466, 'statistics', 6253, '2019_winter')]

In [7]:
%sql select * from exam_results

 * sqlite://
Done.

[(0, 34577, 6743, '06/19/19', 2.0),
 (1, 34577, 2876, '06/06/19', 3.0),
 (2, 34578, 6743, '06/19/19', 4.5)]

### Task: Students who scored 4 and above on their algebra exam

In [8]:
%%sql select S.student_id, S.name, S.surname
from students as S 
inner join exam_results as ER on S.student_id = ER.student_id 
inner join class_catalogue as CC on CC.class_id = ER.class_id 
where CC.class_name = 'algebra' and ER.grade >= 4

 * sqlite://
Done.

[(34578, 'Kate', 'Smith')]